---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyEndParallelTreadsOrRunWidthFailure
source: html/b85dc876-2dc2-e68c-ebed-8f9f22515615.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyEndParallelTreadsOrRunWidthFailure Property

The number of parallel treads at end is too great or the run width is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderTooManyEndParallelTreadsOrRunWidthFailure { get; }
```